package com.finals.c;
/*
 * 蓝桥村的居民都生活在一条公路的边上，公路的长度为L，每户家庭的位置都用这户家庭到公路的起点的距离来计算，第i户家庭距起点的距离为di。
	每年，蓝桥村都要举行一次集会。今年，由于村里的人口太多，村委会决定要在4个地方举行集会，其中3个位于公路中间，1个位最公路的终点。
	已知每户家庭都会向着远离公路起点的方向去参加集会，参加集会的路程开销为家庭内的人数ti与距离的乘积。
	给定每户家庭的位置di和人数ti，请为村委会寻找最好的集会举办地：p1, p2, p3, p4 (p1<=p2<=p3<=p4=L),使得村内所有人的路程开销和最小。
	【输入格式】
	输入的第一行包含两个整数n, L，分别表示蓝桥村的家庭数和公路长度。
	接下来n行，每行两个整数di, ti，分别表示第i户家庭距离公路起点的距离和家庭中的人数。
	【输出格式】
	输出一行，包含一个整数，表示村内所有人路程的开销和。
	【样例输入】
	6 10
	1 3
	2 2                                                     
	4 5
	5 20           
	6 5
	8 7
	【样例输出】
	18
	【样例说明】
	在距起点2, 5, 8, 10这4个地方集会，6个家庭需要的走的距离分别为1, 0, 1, 0, 2, 0，
	总的路程开销为1*3+0*2+1*5+0*20+2*5+0*7=18。
 */
public class 居民集会 {
	public static void main(String[] args) {
		
	}
}
